/**
 * Created by huangmingchao on 2016/6/30.
 */
var myApp = angular.module("app", []);
myApp.controller("indexController", function ($scope) {
    $scope.article = [{
        title:'生活不止眼前的苟且',
        content: "妈妈坐在门前，哼着花儿与少年虽已时隔多年，记得她泪水涟涟,那些幽暗的时光，那些坚持与慌张,在临别的门前，" +
        "妈妈望着我说,生活不止眼前的苟且，还有诗和远方的田野,你赤手空拳来到人世间，为找到那片海不顾一切, 她坐在我对面，低头说珍重再见," +
        "虽已时隔多年，记得她泪水涟涟,那些欢笑的时光，那些誓言与梦想,在分手的街边，她紧抱住我说,生活不止眼前的苟且，还有诗和远方的田野," +
        "你赤手空拳来到人世间，为找到那片海不顾一切,我独自渐行渐远，膝下多了个少年,少年一天天长大，有一天要离开家,看他背影的成长，" +
        "看他坚持与回望,我知道有一天，我会笑着对他说,生活不止眼前的苟且，还有诗和远方的田野,你赤手空拳来到人世间，" +
        "为找到那片海不顾一切.",
        time:'2016/6/30'
},{     title:'最可怕的敌人就是没有信仰',
        content:"你相信“最可怕的敌人就是没有信仰”。"+
        "所以，当生命中有突如其来的灾难是，你第一时间就是寻求信仰庇佑。"+
　　"你早登飞来峰去灵隐诵过经，你夜宿武当山去道观上过香，你每周都去西什库教堂做礼拜。你信奉知行合一张口闭口王阳明，" +
  "你凝视过恶龙逢人聊天必提尼采，你忧国忧民和曾国藩隔空畅谈修身齐家治国平天下。你左青龙右白虎手上套着108颗念珠，你身着步履左手金蟾右手仁波切。" +
        "你以为你诸神在上，可以保佑你平平坦坦度过这一生。但是事实是，该来的磨难还是要来，该错过的好运还是错过，前进的步伐依然沉重而缓慢，战战兢兢，如履薄冰。",
        time:"2016/7/1"
    }];


})